xmlsamples/PI_MTCN/JP-SMS-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-store-request>
         <device>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>KYODAI</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>SUCHADA</first_name>
               <last_name>BURANA</last_name>
            </name>
            <address>
               <addr_line1>ASFJALSKJ</addr_line1>
               <city>TOKYO</city>
               <state>TOKYO</state>
               <postal_code>823749</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>JP</country_code>
                     <currency_code>JPY</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <preferred_customer>
               <permanent_change>EnrollWuCard</permanent_change>
            </preferred_customer>
            <compliance_details>
               <template_id>JPN_01</template_id>
               <id_details>
                  <id_type>C</id_type>
                  <id_country_of_issue>JAPAN</id_country_of_issue>
                  <id_number>141421356</id_number>
               </id_details>
               <id_expiration_date>24042025</id_expiration_date>
               <date_of_birth>01011980</date_of_birth>
               <occupation>Student</occupation>
               <transaction_reason>Migrant Remittance</transaction_reason>
               <Country_of_Birth>CHINA</Country_of_Birth>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>x</ack_flag>
            </compliance_details>
            <contact_phone>87654321</contact_phone>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <bank_details>
               <name>JSB</name>
               <account_number>0211999</account_number>
               <routing_number>123</routing_number>
               <account_type>Savings</account_type>
            </bank_details>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>DENISAWA</first_name>
               <last_name>ALLERTOVA</last_name>
            </name>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>TH</country_code>
                     <currency_code>THB</currency_code>
                  </iso_code>
               </country_code>
               <address_type>I</address_type>
            </address>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>co</state_code>
               <city>shoushi</city>
            </expected_payout_location>
            <recording_country_currency>
               <iso_code>
                  <country_code>JP</country_code>
                  <currency_code>JPY</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>TH</country_code>
                  <currency_code>THB</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>JP</country_code>
                  <currency_code>JPY</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>TOKYO</originating_city>
            <originating_state>TO</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>0.2916169</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <pay_wo_id_indicator>0</pay_wo_id_indicator>
            <credit_debit_card_details>
               <authorization_code/>
            </credit_debit_card_details>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>100</originators_principal_amount>
            <destination_principal_amount>29</destination_principal_amount>
            <gross_total_amount>27300</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <charges>27200</charges>
            <message_charge>0</message_charge>
         </financials>
         <mtcn>3619055889</mtcn>
         <new_mtcn>2011883619055889</new_mtcn>
         <foreign_remote_system>
            <identifier>WGHHJPAP10P</identifier>
            <reference_no>20001287</reference_no>
            <counter_id>JPAP1ARP001A</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>