xmlsamples/PI_MTCN/AU-SMS-AIS.xml

<soapenv:Envelope xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-store-request>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>nGgUGwvJOf</first_name>
               <last_name>vbvydm</last_name>
            </name>
            <address>
               <addr_line1>100 TMP STRT</addr_line1>
               <addr_line2/>
               <city>Melbourne</city>
               <state>Victoria</state>
               <postal_code>1120</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>AU</country_code>
                     <currency_code>AUD</currency_code>
                  </iso_code>
                  <country_name>Australia</country_name>
               </country_code>
               <local_area>FCSS road</local_area>
            </address>
            <preferred_customer/>
            <compliance_details>
               <template_id>UNI_01_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>Australia</id_country_of_issue>
                  <id_place_of_issue>CHENNAI</id_place_of_issue>
                  <id_number>AWE4983</id_number>
               </id_details>
               <id_issue_date>10112000</id_issue_date>
               <id_expiration_date>12112029</id_expiration_date>
               <date_of_birth>01021973</date_of_birth>
               <transaction_reason>Rent/Mortgage</transaction_reason>
               <Country_of_Birth>NIGERIA</Country_of_Birth>
               <nationality>NIGERIA</nationality>
               <Source_of_Funds>Savings</Source_of_Funds>
               <Nature_of_Work_Business>Administration/Clerical/Facilities Svc</Nature_of_Work_Business>
               <Relationship_to_Receiver_Sender>Friend</Relationship_to_Receiver_Sender>
               <ack_flag>X</ack_flag>
               <employer_status>Employed</employer_status>
            </compliance_details>
            <email>IJhh0UUnCooE6a@gmail.com</email>
            <contact_phone>2018212100</contact_phone>
            <date_of_birth>01021973</date_of_birth>
            <place_of_birth>Australia</place_of_birth>
            <mobile_phone>
               <phone_number>
                  <country_code>351</country_code>
                  <national_number>913041096</national_number>
               </phone_number>
            </mobile_phone>
            <cpf_tax_id>98812779971</cpf_tax_id>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <sms_notification_flag>N</sms_notification_flag>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>rfJvYDEBLO</first_name>
               <last_name>YtShBviTco</last_name>
            </name>
            <address>
               <addr_line1>OM# SMS966YL5QY GPZ5HKUSJCZQSE</addr_line1>
               <addr_line2>6XE19GZAV0LB.QX2/BCD</addr_line2>
               <city>Choloma</city>
               <state>OHRID</state>
               <postal_code>23742</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>HR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
                  <country_name>CROATIA</country_name>
               </country_code>
               <local_area>FCSS ROAD</local_area>
            </address>
            <email/>
            <contact_phone>6322596271</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>385</country_code>
                  <national_number>3031514188</national_number>
               </phone_number>
            </mobile_phone>
            <reason_for_sending>P001</reason_for_sending>
         </receiver>
         <bank_details>
            <account_number>HR4723600006456325441</account_number>
            <bank_location>Test location</bank_location>
            <bank_account_holder>Test account</bank_account_holder>
         </bank_details>
         <payment_details>
            <expected_payout_location/>
            <recording_country_currency>
               <iso_code>
                  <country_code>AU</country_code>
                  <currency_code>AUD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>HR</country_code>
                  <currency_code>EUR</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>AU</country_code>
                  <currency_code>AUD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>Melbourne</originating_city>
            <originating_state>Victoria</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>0.5812082</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <pay_wo_id_indicator>N</pay_wo_id_indicator>
            <credit_debit_card_details>
               <authorization_code/>
            </credit_debit_card_details>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>10</originators_principal_amount>
            <destination_principal_amount>6</destination_principal_amount>
            <gross_total_amount>300</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <charges>290</charges>
            <message_charge>0</message_charge>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <mtcn>4450281683</mtcn>
         <new_mtcn>2304484450281683</new_mtcn>
         <foreign_remote_system>
            <identifier>WGHHAU0600T</identifier>
            <reference_no>USATESTREF</reference_no>
            <counter_id>W06N</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>